cmsis-svd/cmsis-svd/data/SiliconLabs/Series2/EFM32PG22/EFM32PG22C200F256IM40.svd
        <register>
          <name>SCAN15</name>
          <description>No Description</description>
          <addressOffset>0x0DC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>PINNEG</name>
              <description>Negative Pin Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTNEG</name>
              <description>Negative Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground (single-ended)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINNEG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINNEG</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINNEG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINNEG</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOS</name>
              <description>Positive Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTPOS</name>
              <description>Positive Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY</name>
                  <description>Supply Pin - Select specific supply using PINPOS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINPOS</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINPOS</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINPOS</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINPOS</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG</name>
              <description>Configuration Group Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFIG0</name>
                  <description>Use configuration group 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG1</name>
                  <description>Use configuration group 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C0_NS</name>
      <version>0</version>
      <description>I2C0_NS Registers</description>
      <baseAddress>0x5A010000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C0</name>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>module enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable Peripheral Clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable Peripheral Clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0037B3FF</resetMask>
          <fields>
            <field>
              <name>CORERST</name>
              <description>Soft Reset the internal state registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No change to internal state registers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Reset the internal state registers</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLAVE</name>
              <description>Addressable as Follower</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>All addresses will be responded to with a NACK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Addresses matching the programmed follower address or the general call address (if enabled) require a response from software. Other addresses are automatically responded to with a NACK.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOACK</name>
              <description>Automatic Acknowledge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Software must give one ACK command for each ACK transmitted on the I2C bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Addresses that are not automatically NACK'ed, and all data is automatically acknowledged.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOSE</name>
              <description>Automatic STOP when Empty</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>A stop must be sent manually when no more data is to be transmitted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The leader automatically sends a STOP when no more data is available for transmission.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOSN</name>
              <description>Automatic STOP on NACK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Stop is not automatically sent if a NACK is received from a follower.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The leader automatically sends a STOP if a NACK is received from a follower.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARBDIS</name>
              <description>Arbitration Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>When a device loses arbitration, the ARBIF interrupt flag is set and the bus is released.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>When a device loses arbitration, the ARBIF interrupt flag is set, but communication proceeds.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GCAMEN</name>
              <description>General Call Address Match Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>General call address will be NACK'ed if it is not included by the follower address and address mask.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>When a general call address is received, a software response is required</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXBIL</name>
              <description>TX Buffer Interrupt Level</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>TXBL status and the TXBL interrupt flag are set when the transmit buffer becomes empty. TXBL is cleared when the buffer becomes nonempty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_FULL</name>
                  <description>TXBL status and the TXBL interrupt flag are set when the transmit buffer goes from full to half-full or empty. TXBL is cleared when the buffer becomes full</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLHR</name>
              <description>Clock Low High Ratio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Nlow=4 and Nhigh=4, and the Nlow:Nhigh ratio is 4:4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYMMETRIC</name>
                  <description>Nlow=6 and Nhigh=3, and the Nlow:Nhigh ratio is 6:3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST</name>
                  <description>Nlow=11 and Nhigh=6, and the Nlow:Nhigh ratio is 11:6</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BITO</name>
              <description>Bus Idle Timeout</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Timeout disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C40PCC</name>
                  <description>Timeout after 40 prescaled clock cycles. In standard mode at 100 kHz, this results in a 50us timeout.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C80PCC</name>
                  <description>Timeout after 80 prescaled clock cycles. In standard mode at 100 kHz, this results in a 100us timeout.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C160PCC</name>
                  <description>Timeout after 160 prescaled clock cycles. In standard mode at 100 kHz, this results in a 200us timeout.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIBITO</name>
              <description>Go Idle on Bus Idle Timeout </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>A bus idle timeout has no effect on the bus state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>A bus idle timeout tells the I2C module that the bus is idle, allowing new transfers to be initiated.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLTO</name>
              <description>Clock Low Timeout</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Timeout disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C40PCC</name>
                  <description>Timeout after 40 prescaled clock cycles. In standard mode at 100 kHz, this results in a 50us timeout.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C80PCC</name>
                  <description>Timeout after 80 prescaled clock cycles. In standard mode at 100 kHz, this results in a 100us timeout.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C160PCC</name>
                  <description>Timeout after 160 prescaled clock cycles. In standard mode at 100 kHz, this results in a 200us timeout.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C320PCC</name>
                  <description>Timeout after 320 prescaled clock cycles. In standard mode at 100 kHz, this results in a 400us timeout.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1024PCC</name>
                  <description>Timeout after 1024 prescaled clock cycles. In standard mode at 100 kHz, this results in a 1280us timeout.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCLMONEN</name>
              <description>SCL Monitor Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable SCL monitor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable SCL monitor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDAMONEN</name>
              <description>SDA Monitor Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable SDA Monitor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable SDA Monitor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
